In [2]:
import mysql.connector as connector
import pandas as pd

In [17]:
try:

    connection = connector.connect(
        user = 'root',
        password = '******')

    print('Connected...')

except connector.Error as err:
    
    print('Error code: ', err.errno)
    print('Error message: ', err.msg)

Connected...

In [18]:
# 2 - Create Cursor:

if connection.is_connected():
    cursor = connection.cursor(buffered=True)
    print('Cursor ready...')
else:
    print('It was not possible to create cursor as connection was not previously established...')

Cursor ready...

In [19]:
# 3 - Select Database:

cursor.execute("USE meta_py_to_mysql")

print('Your Database is: ', connection.database )

Your Database is:  meta_py_to_mysql

In [13]:
cursor.execute("SHOW TABLES")
for table in cursor:
    print(table)

('bookings',)
('menu_items',)
('menus',)
('orders',)

In [6]:
# UPDATE
update_booking = """UPDATE bookings 
SET tableNo = 10, employeeID = 4  
WHERE bookingID = 6"""

cursor.execute(update_booking)
connection.commit()

# SELECT

cursor.execute("""SELECT * 
FROM bookings 
ORDER BY bookingID""")

result_update = cursor.fetchmany(size=6)
columns_update = cursor.column_names

# Dataframe

df_update = pd.DataFrame(data=result_update,columns=columns_update)
df_update

   bookingID  tableNo guestFirstName guestLastName     bookingSlot  employeeID
0          1       12           Anna       Iversen 0 days 19:00:00           1
1          2       12         Joakim       Iversen 0 days 19:00:00           1
2          3       19        Vanessa      McCarthy 0 days 15:00:00           3
3          5        5         Hiroki        Yamane 0 days 18:30:00           2
4          6       10          Diana         Pinto 0 days 20:00:00           4

In [7]:
# DELETE

delete_booking = """DELETE FROM bookings 
WHERE bookingID = 4"""

cursor.execute(delete_booking)
connection.commit()

# SELECT 
cursor.execute("""SELECT * FROM bookings""")
afterDelete_result = cursor.fetchall()
afterDelete_columns = cursor.column_names

# DataFrame

df_afterDelete = pd.DataFrame(data=afterDelete_result, columns=afterDelete_columns)
df_afterDelete

   bookingID  tableNo guestFirstName guestLastName     bookingSlot  employeeID
0          1       12           Anna       Iversen 0 days 19:00:00           1
1          2       12         Joakim       Iversen 0 days 19:00:00           1
2          3       19        Vanessa      McCarthy 0 days 15:00:00           3
3          5        5         Hiroki        Yamane 0 days 18:30:00           2
4          6       10          Diana         Pinto 0 days 20:00:00           4

In [18]:
# USING WHERE, ORDER BY AND LIMIT:

cursor.execute("""SELECT name, type, price 
FROM menu_items 
WHERE price > 10 
ORDER BY type, price ASC LIMIT 5""")

filter_order_result = cursor.fetchall()
filter_order_columns = cursor.column_names

# DataFrame

df_afterDelete = pd.DataFrame(data=filter_order_result, columns=filter_order_columns)
df_afterDelete

                name          type  price
0  Athens White wine        Drinks     25
1     Corfu Red Wine        Drinks     30
2          Bean soup  Main Courses     12
3        Greek salad  Main Courses     15
4              Pizza  Main Courses     15

In [23]:
# USING INNER JOIN (2 tables):

inner_join_menu_items_menus = """ SELECT m.menuID AS menu_ID, mi.name, mi.type, m.cuisine, mi.price
FROM menu_items mi 
INNER JOIN menus m 
ON mi.itemID = m.itemID
"""

cursor.execute(inner_join_menu_items_menus)
inner_join_result = cursor.fetchall()
inner_join_columns= cursor.column_names

df_inner_join = pd.DataFrame(data=inner_join_result, columns= inner_join_columns)
df_inner_join

    menu_ID               name          type  cuisine  price
0         1             Olives      Starters    Greek      5
1         1        Greek salad  Main Courses    Greek     15
2         1      Greek yoghurt      Desserts    Greek      7
3         1  Athens White wine        Drinks    Greek     25
4         2         Minestrone      Starters  Italian      8
5         2              Pizza  Main Courses  Italian     15
6         2         Cheesecake      Desserts  Italian      4
7         2     Turkish Coffee        Drinks  Italian     10
8         3            Falafel      Starters  Turkish      7
9         3          Ice cream      Desserts  Turkish      6
10        3     Turkish Coffee        Drinks  Turkish     10
11        3             Kabasa  Main Courses  Turkish     17

In [24]:
# USING LEFT JOIN (2 tables):

left_join_menu_items_menus = """ SELECT m.menuID AS menu_ID, mi.name, mi.type, m.cuisine, mi.price
FROM menu_items mi 
LEFT JOIN menus m 
ON mi.itemID = m.itemID
"""

cursor.execute(left_join_menu_items_menus)
left_join_result = cursor.fetchall()
left_join_columns= cursor.column_names

df_left_join = pd.DataFrame(data=left_join_result, columns= left_join_columns)
df_left_join

    menu_ID               name          type  cuisine  price
0       1.0             Olives      Starters    Greek      5
1       NaN          Flatbread      Starters     None      5
2       2.0         Minestrone      Starters  Italian      8
3       NaN       Tomato bread      Starters     None      8
4       3.0            Falafel      Starters  Turkish      7
5       NaN             Hummus      Starters     None      5
6       1.0        Greek salad  Main Courses    Greek     15
7       NaN          Bean soup  Main Courses     None     12
8       2.0              Pizza  Main Courses  Italian     15
9       1.0      Greek yoghurt      Desserts    Greek      7
10      3.0          Ice cream      Desserts  Turkish      6
11      2.0         Cheesecake      Desserts  Italian      4
12      1.0  Athens White wine        Drinks    Greek     25
13      NaN     Corfu Red Wine        Drinks     None     30
14      2.0     Turkish Coffee        Drinks  Italian     10
15      3.0     Turkish Coffee        Drinks  Turkish     10
16      3.0             Kabasa  Main Courses  Turkish     17

In [25]:
# USING RIGHT JOIN (2 tables):

right_join_menu_items_menus = """ SELECT m.menuID AS menu_ID, mi.name, mi.type, m.cuisine, mi.price
FROM menu_items mi 
RIGHT JOIN menus m 
ON mi.itemID = m.itemID
"""

cursor.execute(right_join_menu_items_menus)
right_join_result = cursor.fetchall()
right_join_columns= cursor.column_names

df_right_join = pd.DataFrame(data=right_join_result, columns= right_join_columns)
df_right_join

    menu_ID               name          type  cuisine  price
0         1             Olives      Starters    Greek      5
1         1        Greek salad  Main Courses    Greek     15
2         1      Greek yoghurt      Desserts    Greek      7
3         1  Athens White wine        Drinks    Greek     25
4         2         Minestrone      Starters  Italian      8
5         2              Pizza  Main Courses  Italian     15
6         2         Cheesecake      Desserts  Italian      4
7         2     Turkish Coffee        Drinks  Italian     10
8         3            Falafel      Starters  Turkish      7
9         3          Ice cream      Desserts  Turkish      6
10        3     Turkish Coffee        Drinks  Turkish     10
11        3             Kabasa  Main Courses  Turkish     17

In [22]:
# Join with three tables to see who is ordering, with tableNo and what's is the cuisine of the food:

join3 = """
SELECT o.orderID, o.tableNo, CONCAT(b.guestFirstName,' ', b.guestLastName) AS guestName, m.cuisine 
FROM orders o
INNER JOIN bookings b
ON b.bookingID = o.bookingID
INNER JOIN menus m 
ON o.menuID = m.menuID GROUP BY o.tableNo ORDER BY orderID
"""
cursor.execute(join3)

result_join3 = cursor.fetchall()
columns_join3 = cursor.column_names

df_join3 = pd.DataFrame(data=result_join3, columns= columns_join3)
df_join3.style.hide(axis='index')

In [23]:
# Close the connection:

if connection.is_connected():
    cursor.close()
    print('Cursor closed...')
    connection.close()
    print('Disconnected...')
else:
    print('Already disconnected')

Cursor closed...
Disconnected...